In [1]:
import pandas as pd
import numpy as np
import os
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df_adalab = pd.read_csv('data/df_adalab.csv', index_col = 'index')
df_adalab.drop('Unnamed: 0', axis = 1, inplace = True)
df_adalab.head(2)

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Reddit,media_Kaggle,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER
index,,,,,,,,,,,,,,,,,,,,,
0,910,50-54,Man,India,Bachelor’s degree,Other,5-10 years,Manufacturing/Fabrication,"25,000-29,999",NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,"YouTube (Kaggle YouTube, Cloud AI Adventures, ...","Podcasts (Chai Time Data Science, O’Reilly Dat...","Blogs (Towards Data Science, Analytics Vidhya,...","Journal Publications (peer-reviewed journals, ...",NaN,NaN,NaN
1,784,50-54,Man,Indonesia,Master’s degree,Program/Project Manager,20+ years,Manufacturing/Fabrication,"60,000-69,999",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,"Journal Publications (peer-reviewed journals, ...",NaN,NaN,NaN

In [3]:
#miramos los valores nulos de nuestros datos
df_adalab.loc[:,:'salary'].isnull().sum()

time                     0
age                      0
gender                   0
country                  0
education                0
role                     0
coding_experience        0
field                 9648
salary               10582
dtype: int64

In [4]:
#miramos cuantas filas tenemos en total
df_adalab.shape

(25973, 43)

In [5]:
#miramos cuantas profesiones tenemos y cuántos registros de cada profesion
df_adalab['role'].value_counts()

role
Student                         6804
Data Scientist                  3616
Software Engineer               2449
Other                           2393
Data Analyst                    2301
Currently not employed          1986
Research Scientist              1538
Machine Learning Engineer       1499
Business Analyst                 968
Program/Project Manager          849
Data Engineer                    668
Product Manager                  319
Statistician                     313
DBA/Database Engineer            171
Developer Relations/Advocacy      99
Name: count, dtype: int64

In [6]:
#posible filtrado para analisis posteriores de nuestros datos:
#student, data analyst, other, currently not employed,

In [7]:
df_da = df_adalab[df_adalab['role'] == 'Data Analyst']
df_da.head(2)

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Reddit,media_Kaggle,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER
index,,,,,,,,,,,,,,,,,,,,,
16,1315,50-54,Man,Belgium,Bachelor’s degree,Data Analyst,20+ years,Energy/Mining,"2,000-2,999",NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
32,171,22-24,Nonbinary,United States of America,Some college/university study without earning ...,Data Analyst,< 1 years,Manufacturing/Fabrication,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df_da.to_csv('data/df_da.csv')

In [9]:
df_da.isnull().sum()

time                              0
age                               0
gender                            0
country                           0
education                         0
role                              0
coding_experience                 0
field                           114
salary                          262
share_plotlydash               2266
share_streamlit                2252
share_NBViewer                 2278
share_GitHub                   1739
share_Personal blog            2208
share_Kaggle                   1863
share_Colab                    2104
share_Shiny                    2251
share_None                     1884
share_OTHER                    2253
courses_Coursera               1409
courses_edX                    1993
courses_Kaggle                 1483
courses_DataCamp               1758
courses_Fastai                 2241
courses_Udacity                2032
courses_Udemy                  1587
courses_LinkedIn               1934
courses_Cloud-certification    2152
courses_University             1930
courses_None                   2301
courses_OTHER                  2075
media_Twitter                  1992
media_Email                    1998
media_Reddit                   2030
media_Kaggle                   1252
media_Forums                   2034
media_YouTube                  1332
media_Podcasts                 2121
media_Blogs                    1617
media_Journal                  2117
media_Slack                    2110
media_None                     2301
media_OTHER                    2244
dtype: int64

In [10]:
df_da_filtrado = df_da.loc[:,'age':'salary']
df_da_filtrado.head()

,age,gender,country,education,role,coding_experience,field,salary
index,,,,,,,,
16,50-54,Man,Belgium,Bachelor’s degree,Data Analyst,20+ years,Energy/Mining,"2,000-2,999"
32,22-24,Nonbinary,United States of America,Some college/university study without earning ...,Data Analyst,< 1 years,Manufacturing/Fabrication,NaN
33,30-34,Woman,Egypt,Bachelor’s degree,Data Analyst,3-5 years,Non-profit/Service,"7,500-9,999"
46,22-24,Man,China,Some college/university study without earning ...,Data Analyst,< 1 years,Computers/Technology,$0-999
52,40-44,Man,South Africa,Master’s degree,Data Analyst,1-3 years,Manufacturing/Fabrication,"25,000-29,999"

In [11]:
european_countries = ["Albania", "Andorra", "Austria", "Belarus", "Belgium", "Bosnia and Herzegovina", "Bulgaria", "Croatia", "Cyprus", "Czech Republic", "Denmark", "Estonia", "Finland", "France", "Germany", "Greece", "Hungary", "Iceland", "Ireland", "Italy", "Latvia", "Liechtenstein", "Lithuania", "Luxembourg", "Malta", "Moldova", "Monaco", "Montenegro", "Netherlands", "North Macedonia", "Norway", "Poland", "Portugal", "Romania", "Russia", "San Marino", "Serbia", "Slovakia", "Slovenia", "Spain", "Sweden", "Switzerland", "Ukraine", "United Kingdom", "Vatican City"]

In [12]:
df_da_europa = df_da[df_da['country'].isin(european_countries)]
df_da_europa.head(2)

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Reddit,media_Kaggle,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER
index,,,,,,,,,,,,,,,,,,,,,
16,1315,50-54,Man,Belgium,Bachelor’s degree,Data Analyst,20+ years,Energy/Mining,"2,000-2,999",NaN,...,NaN,"Kaggle (notebooks, forums, etc)",NaN,NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN
247,497,22-24,Man,Ukraine,Doctoral degree,Data Analyst,3-5 years,Other,$0-999,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df_da_europa['coding_experience'].unique()

array(['20+ years', '3-5 years', '1-3 years', '< 1 years', '5-10 years',
       '10-20 years', 'I have never written code'], dtype=object)

In [14]:
def experience(experiencia):
    if experiencia == 'I have never written code':
        return 'Sin experiencia'
    elif experiencia == '< 1 years' or experiencia == '1-3 years':
        return 'Junior'
    elif experiencia == '3-5 years':
        return 'Mid'
    elif  experiencia == '5-10 years':
        return 'Senior'
    elif experiencia == '10-20 years' or experiencia == '20+ years':
        return 'Senior+'

In [15]:
df_da_europa['expererience_cut'] = df_da_europa['coding_experience'].apply(experience)
df_da_europa.head(2)

/tmp/ipykernel_20191/1206866042.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_da_europa['expererience_cut'] = df_da_europa['coding_experience'].apply(experience)

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Kaggle,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER,expererience_cut
index,,,,,,,,,,,,,,,,,,,,,
16,1315,50-54,Man,Belgium,Bachelor’s degree,Data Analyst,20+ years,Energy/Mining,"2,000-2,999",NaN,...,"Kaggle (notebooks, forums, etc)",NaN,NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN,Senior+
247,497,22-24,Man,Ukraine,Doctoral degree,Data Analyst,3-5 years,Other,$0-999,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mid

In [16]:
df_da_europa['salary'].unique()

array(['2,000-2,999', '$0-999', '1,000-1,999', '60,000-69,999', nan,
       '15,000-19,999', '30,000-39,999', '25,000-29,999', '20,000-24,999',
       '40,000-49,999', '50,000-59,999', '7,500-9,999', '80,000-89,999',
       '10,000-14,999', '100,000-124,999', '3,000-3,999',
       '125,000-149,999', '5,000-7,499', '4,000-4,999', '70,000-79,999',
       '90,000-99,999', '150,000-199,999', '>$1,000,000'], dtype=object)

In [17]:
# Vamos a ver quién es el del salario atípico:
df_da_europa[df_da_europa['salary'] == '>$1,000,000']

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Kaggle,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER,expererience_cut
index,,,,,,,,,,,,,,,,,,,,,
19998,621,35-39,Man,Germany,Master’s degree,Data Analyst,< 1 years,Online Service/Internet-based Services,">$1,000,000",NaN,...,"Kaggle (notebooks, forums, etc)","Course Forums (forums.fast.ai, Coursera forums...","YouTube (Kaggle YouTube, Cloud AI Adventures, ...",NaN,NaN,NaN,"Slack Communities (ods.ai, kagglenoobs, etc)",NaN,NaN,Junior

In [23]:
def salario(sal):
    try:
        if sal in ['$0-999', '1,000-1,999', '2,000-2,999', '3,000-3,999', '4,000-4,999', '5,000-7,499', '7,500-9,999', '10,000-14,999', '15,000-19,999', '20,000-24,999']:
            return '< 25K'
        elif sal in ['25,000-29,999', '30,000-39,999', '40,000-49,999']:
            return '25K - 50K'
        elif sal in ['50,000-59,999', '60,000-69,999', '70,000-79,999', '80,000-89,999', '90,000-99,999']:
            return '50K - 100K'
        elif sal in ['100,000-124,999', '125,000-149,999', '150,000-199,999', '>$1,000,000']:
            return '> 100K'
    except:
        return np.nan

In [24]:
df_da_europa['salary_cut'] = df_da_europa['salary'].apply(salario)
df_da_europa.head(2)

/tmp/ipykernel_20191/4067821337.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_da_europa['salary_cut'] = df_da_europa['salary'].apply(salario)

,time,age,gender,country,education,role,coding_experience,field,salary,share_plotlydash,...,media_Forums,media_YouTube,media_Podcasts,media_Blogs,media_Journal,media_Slack,media_None,media_OTHER,expererience_cut,salary_cut
index,,,,,,,,,,,,,,,,,,,,,
16,1315,50-54,Man,Belgium,Bachelor’s degree,Data Analyst,20+ years,Energy/Mining,"2,000-2,999",NaN,...,NaN,NaN,NaN,"Blogs (Towards Data Science, Analytics Vidhya,...",NaN,NaN,NaN,NaN,Senior+,< 25K
247,497,22-24,Man,Ukraine,Doctoral degree,Data Analyst,3-5 years,Other,$0-999,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Mid,< 25K

In [25]:
df_da_europa.drop(['coding_experience', 'salary'], axis = 1, inplace = True)

/tmp/ipykernel_20191/1024950132.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_da_europa.drop(['coding_experience', 'salary'], axis = 1, inplace = True)

In [27]:
df_da_europa['age'].unique()

array(['50-54', '22-24', '25-29', '30-34', '40-44', '45-49', '35-39',
       '18-21', '55-59', '60-69'], dtype=object)

In [28]:
df_da_europa['age'].value_counts()

age
25-29    69
30-34    53
35-39    43
40-44    33
22-24    30
50-54    21
45-49    21
18-21    12
55-59     7
60-69     2
Name: count, dtype: int64

In [29]:
df_da_europa.duplicated().sum()

0